{
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "course": "Web and Multimedia Development",
    "about-btn": "About",
    "about-tl": "About Me",
    "resume": "Hi, I'm <span class='highlight'>Miguel</span>, a 20 year old <span class='highlight'>Web Development and Multimedia</span> specialist from <span class='highlight'>Barcelos</span>, graduated at Higher School of Technology and Management - <span class='highlight'>IPVC</span>. In my <span class='highlight'>professional</span> journey, I've <span class='highlight'>specialized</span> in Graphic Design, Motion Graphics Design, and Social Media Management, which includes tasks like <span class='highlight'>creating</span> social media <span class='highlight'>posters</span> and digital <span class='highlight'>logo animations</span>, including other examples.",
    "resume-tab": "Resume",
    "education": "Education",
    "experience": "Experience",
    "skills": "Skills",
    "course-about": "Web and Multimedia Development",
    "school": "Higher School of Technology and Management",
    "course-about-12": "Restaurant/Bar",
    "month": "July",
    "exp-1": "Social Media Content Creator",
    "exp-2": "Social Media Manager",
    "exp-3": "Motion Graphics Designer",
    "port": "Portfolio",
    "all": "All",
    "socialmedia": "Social Media",
    "motiongraphics": "Motion Graphics",
    "social+motion": "Social Media Motion Graphics",
    "solarenergy": "Solar Energy",
    "socialmediaport": "Social Media",
    "hamburguer": "Burguer Place",
    "solarenergyinfo": "<p>Solar Home, a fictitious company that leads the solar energy sector, aimed to stand out on social media. The challenge was clear: to create an attractive poster that would catch the eye of new customers and encourage them to adopt solar energy as their source of sustainable energy.</p><br><p>The approach involved creating a vibrant poster, with colors that echoed the vitality of solar energy. Combined with a captivating image, the poster was planned meticulously, ensuring that each element stood out and delivered an impactful message. The result was an original poster that not only captured attention, but also provided crucial information and an easy way to get in touch.</p><br><p>This represents a clear example of commitment to transforming challenges into creative and impactful opportunities.</p>",
    "hamburgueria": "Burguer Place",
    "hamburgueriainfo": "<p>Hamburgueria Machado, a place known for its delicious food and top-quality service, had a captivating and professional poster created to showcase one of its mouthwatering burger options from the menu, served with a classic coca-cola and irresistible french fries.</p><br><p>The goal was to design a poster that captures the essence of Hamburgueria Machado's unbeatable burger flavors. To achieve this, every detail was carefully planned, with the selection of vibrant colors that spark a love for food, along with appealing images and a text that would stimulate the customer's curiosity.</p><br><p> The outcome was a clean but vibrant poster that not only catches the eye of customers, but also informs about the tempting offers.</p>",
    "bangkokinfo": "<p>Bangkok Thai Restaurant is a renowned gastronomic establishment located in Barcelos, known for its authentic Thai cuisine, welcoming atmosphere and exceptional service.</p><br><p>The challenge in working with Bangkok Thai Restaurant was to develop a comprehensive social media strategy and create captivating visual content to effectively promote the restaurant on social media, but also inform customers of possible changes to  opening hours. The main objective was to increase online visibility, engage the local community and convey the authenticity of the Bangkok Thai Restaurant experience. To this end, we collaborated with the client to develop a customized social media strategy that involved setting goals and creating a publication schedule.</p><br><p>A variety of visual materials were produced, including images of delicious dishes and motion graphics that reflected the authenticity and richness of Thai cuisine, achieving the client's goals of good social media growth.</p>",
    "dreamsakosinfo": "<p>Dreamsakos is a company that specializes in creating customized packaging, covering a wide range of products, from paper bags, reusable fabric, recyclable laminates and even solutions such as PVC, tapes and labels.</p><br><p>The objective was to create graphic materials such as promotional posters for social media and to develop a digital animation of the company's logo. Before starting production, a publication schedule was proposed and defined in collaboration with the client to ensure consistent content distribution on social media. These posters were designed to attract new customers, featuring compelling images of finished products for maximum engagement.</p><br><p>The primary focus of the digital animation was on the logo, creating a simple yet creative animation that was later shared on social media.</p>",
    "bestsolinfo": "<p>BestSol is a company with experience in the solar energy sector, committed to providing sustainable energy solutions through a highly qualified team.</p><br><p>This project was developed with its purpose in mind, which was to promote its services and acquire new customers. With this in mind, a number of posters were developed for social media, mainly referring to renewable energy and raising awareness among potential customers of this energy source.</p><br><p>The main colors used were shades of orange, blue and green that refer to nature and renewable energy, which had a positive effect, generating an increase in shares and followers on social media.</p>",
    "e+3plusinfo": "<p>E+3 Plus is a textile company with a solid focus on the B2B (Business to Business) market, specialized in the production of sustainable, luxury and high-quality clothing achieved through its vertical approach.</p><br><p>This company had several visual elements created in English, given its large number of foreign clients. As well as promoting the company and its B2B platform, the posters were also used to highlight its textile machinery, showcasing its working methods and establishing a deeper connection with potential customers.</p><br><p>This is an example of the diversity that can be achieved by maintaining the company's values and brand on each poster developed.</p>",
    "ec3rinfo": "<p>EC3R, a waste management and recycling company, specializes in the collection and management of Used Cooking Oil (UCO), with its main activity involving the recycling of this waste and directing it towards the production of advanced biofuels.</p><br><p>The mission of this project was to make people aware of the importance of recycling used cooking oil. With this in mind, it was defined in collaboration with EC3R that several key points should be reflected in each poster, including a presentation of the company, its services, its partners, and the benefits of recycling UCO.</p><br><p>These posters were developed with a minimalist and simple look that met the expectations of the client and the designated message.</p>",
    "aznegociosinfo": "<p>AZ Negócios is a company specialized in internet and multimedia with experience in web design and website construction.</p><br><p>Due to their interest in standing out on social media, in order to attract more clients, various multimedia contents were developed, including a digital animation of their logo, as well as the design of posters to promote the company and the services it offers. To achieve this prominence on social networks, the posters were developed with various 3D elements and vibrant colors that would capture the attention of potential customers, while maintaining the presence of the brand so that they could be easily recognized.</p><br><p>The result was positive, with good engagement and increased visibility for the company on social media.</p>",
    "ecgmdwminfo": "<p>This project involved creating digital animations of the logos for the DWM (Web and Multimedia Development) and ECGM (Computer Graphics and Multimedia Engineering) academic courses. The DWM course is a CTeSP (Higher Professional Technical Course), where the ECGM is a bachelor's degree. The animations were developed as part of the Web and Multimedia Project curricular unit.</p><br><p>Each animation was carefully planned and executed to last between 5 and 8 seconds, making them ideal for use in course presentations. The most outstanding aspect of this project was the uniqueness of the animations, each of which adopted a distinct visual style.</p><br><p>The main objective was to develop animations that not only represented the courses, but also captured the audience's attention and reflected the uniqueness of both courses effectively.</p>",
    "contactme": "Contact Me",
    "yourname": "Name",
    "yourmessage": "Message",
    "submit": "Submit",
    "throughmy": "Through my",
    "orthisform": "Or this form",
    "reset": "Reset",
    "privacyform": "I declare that I have read and accept the",
    "privacyformmessage": "Please accept the privacy policy in order to submit the form.",
    "privacyformmessageno": "(If you don't accept, you won't be able to send this form).",
    "no": "No",
    "yes": "Yes",
    "privacypolicy": "Privacy Policy",
    "cookiepolicy": "Cookie Policy",
    "pp1": "1. Introduction",
    "pp1info": "Welcome to Miguel Miranda's Portfolio. Your privacy is important to us. This Privacy Policy explains how we collect, use and protect the personal information you provide when you visit our Site.",
    "pp2": "2. Information we collect",
    "pp2info1": "When you visit the Site, we collect the following information:",
    "pp2info2": "<strong>Name and e-mail address: </strong>This information is collected via the Site's contact form.",
    "pp2info3": "<strong>Usage data: </strong>This data is collected through cookies, including Google Analytics cookies. For more information on cookies, see the 'Cookies' section below.",
    "pp3": "3. How We Use Your Information",
    "pp3info1": "We only use your personal information for the following purposes:",
    "pp3info2": "<strong>To answer your queries sent via the contact form.</strong>",
    "pp3info3": "<strong>To analyze Website traffic and improve our services.</strong>",
    "pp4": "4. Cookies",
    "pp4info1": "We use cookies to collect information about your use of the Site. For detailed information on cookies used, how to disable them and manage your preferences, please see our",
    "pp4info2": "Cookie Policy.",
    "pp5": "5. Information sharing",
    "pp5info": "We do not share your personal information with third parties unless it is necessary to comply with legal obligations.",
    "pp6": "6. Data Protection",
    "pp6info": "We take steps to protect your personal information and ensure its security.",
    "pp7": "7. Your Rights",
    "pp7info": "You have the right to access, correct, delete or object to the processing of your personal information. To exercise these rights or ask questions about this Privacy Policy, please contact us using the details provided in the contact section.",
    "pp8": "8. Changes to this Policy",
    "pp8info": "We may update this Privacy Policy from time to time. Any changes will be posted on this page.",
    "pp9": "9. Statement of applicability",
    "pp9info": "This Privacy Policy applies to all users of the site, including users from the European Union.",
    "pp10": "10. Security of personal data",
    "pp10info1": "The security of our users' personal data is important to us. We take security measures to protect this data, but it is important to remember that no transmission over the Internet or electronic storage is 100% secure.",
    "pp10info2": "The Portefólio Miguel Miranda website takes the necessary security measures to protect its users' personal data. These measures include storing personal data on secure servers.",
    "pc1": "1. What are cookies?",
    "pc1info": "Cookies are small text files that are stored on your device when you visit a website. They are widely used to make websites more efficient and improve the user experience. Cookies can also be used to track information about how visitors interact with the website.",
    "pc2": "2. How do we use cookies?",
    "pc2info1": "We use cookies for the following purposes:",
    "pc2info2": "<strong>Essential cookies: </strong>These cookies are essential for you to be able to browse the website and use its features. Without these cookies, we cannot provide you with services you have asked for, such as remembering your cookie settings.",
    "pc2info3": "<strong>Performance cookies: </strong>These cookies help us understand how visitors interact with our website by collecting anonymous information. This allows us to continually improve our site and your experience.",
    "pc2info4": "<strong>Functionality cookies: </strong>These cookies allow the site to remember choices you make (such as language and Dark/Light Mode) and offer enhanced features.",
    "pc2info5": "<strong>Third-party cookies: </strong>This website may also include third-party cookies, such as Google Analytics, which is used to collect information about how visitors use the website. These cookies can be used to provide targeted advertisements based on your browsing preferences.",
    "pc3": "3. Cookies used",
    "pc3info1": "Below is a list of the cookies that may be used on this website, together with their purposes:",
    "pc3info2": "<strong>Cookie '_ga'</strong>",
    "pc3info3": "<strong>Purpose: </strong>This cookie is used by Google Analytics to collect information on how users interact with the website. The data collected is used to improve the performance of the website.",
    "pc3info4": "<strong>Expiry date: </strong>This cookie will expire in 400 days.",
    "pc3info5": "<strong>Category: </strong>Third Party Cookie (Analysis Cookie).",
    "pc3info6": "<strong>Owner: </strong>Google Analytics.",
    "pc3info7": "<strong>Cookie '_ga_N6DXWGWBTK'</strong>",
    "pc3info8": "<strong>Purpose: </strong>This cookie is used by Google Analytics to identify individual users and to track their activity on the website. The data collected is used to improve the performance of the website and to provide users with a more personalized experience.",
    "pc3info9": "<strong>Expiry date: </strong>This cookie will expire in 400 days.",
    "pc3info10": "<strong>Category: </strong>Third Party Cookie (Analysis Cookie).",
    "pc3info11": "<strong>Owner: </strong>Google Analytics.",
    "pc3info12": "<strong>Cookie 'accept'</strong>",
    "pc3info13": "<strong>Purpose: </strong>This cookie is used by the Miguel Miranda Portfolio website to identify and store the 'Accept' choice in the Cookies Pop-Up.",
    "pc3info14": "<strong>Expiry date: </strong>This cookie will expire in 400 days.",
    "pc3info15": "<strong>Category: </strong>Essential Cookie.",
    "pc3info16": "<strong>Owner: </strong>Miguel Miranda Portfolio website.",
    "pc3info17": "<strong>Cookie 'decline'</strong>",
    "pc3info18": "<strong>Purpose: </strong>This cookie is used by the Miguel Miranda Portfolio website to identify and store the 'Reject' choice in the Cookies Pop-Up.",
    "pc3info19": "<strong>Expiry date: </strong>This cookie will expire in 400 days.",
    "pc3info20": "<strong>Category: </strong>Essential Cookie.",
    "pc3info21": "<strong>Owner: </strong>Miguel Miranda Portfolio website.",
    "pc3info22": "<strong>Cookie 'learnmore'</strong>",
    "pc3info23": "<strong>Purpose: </strong>This cookie is used by the Miguel Miranda Portfolio website to identify and store the 'Learn More' choice in the Cookies Pop-Up.",
    "pc3info24": "<strong>Expiry date: </strong>This cookie will expire in 1 Day or after the user chooses 'Accept' or 'Decline' in the Cookies Pop-Up.",
    "pc3info25": "<strong>Category: </strong>Essential Cookie.",
    "pc3info26": "<strong>Owner: </strong>Miguel Miranda Portfolio website.",
    "pc4": "4. How to manage cookies",
    "pc4info1": "You can manage your cookie preferences by changing your browser settings. You can choose to accept or refuse cookies. Remember that refusing cookies may affect the functionality of the site.",
    "pc4info2": "For detailed information on how to manage cookies and your browser settings, please refer to the documentation of the browser you use.",
    "pc5": "5. Changes to the cookie policy",
    "pc5info": "We may update our cookie policy as necessary to reflect changes in our cookie practices. Any changes will be reflected on this page.",
    "pc6": "6. Statement of applicability",
    "pc6info": "This Cookie Policy applies to all users of the website, including users from the European Union.",
    "pc7": "7. Security of personal data",
    "pc7info1": "The security of our users' personal data is important to us. We take security measures to protect this data, but it is important to remember that no transmission over the Internet or electronic storage is 100% secure.",
    "pc7info2": "The Portefólio Miguel Miranda website takes the necessary security measures to protect its users' personal data. These measures include storing personal data on secure servers.",
    "next": "Next",
    "previous": "Previous",
    "cookiesconsent": "Cookies Consent",
    "cookiesmessage": "This website uses cookies to improve your browsing experience. By clicking 'Accept', you agree to the use of cookies. To find out more about the cookies we use, see our cookie policy.",
    "accept": "Accept",
    "decline": "Decline",
    "learnmore": "Learn More",
    "cookieserrormessage": "Cookie can't be set!"
}