{
    "home": "Início",
    "about": "Sobre",
    "portfolio": "Portefólio",
    "contact": "Contactos",
    "course": "Desenvolvimento Web e Multimédia",
    "about-btn": "Sobre",
    "about-tl": "Sobre Mim",
    "resume": "Olá, sou o <span class='highlight'>Miguel</span>, um jovem de 20 anos especialista em <span class='highlight'>Desenvolvimento Web e Multimédia</span> de <span class='highlight'>Barcelos</span>, graduado na Escola Superior de Tecnologia e Gestão - <span class='highlight'>IPVC</span>. Durante a minha carreira <span class='highlight'>profissional</span> <span class='highlight'>especializei-me</span> em Design Gráfico, Motion Graphics e Gestão de Redes Sociais que incluiu tarefas como <span class='highlight'>criar posters</span> para as redes sociais e <span class='highlight'>animações</span> digitais de <span class='highlight'>logótipos</span>, incluindo outros exemplos.",
    "resume-tab": "Resumo",
    "education": "Educação",
    "experience": "Experiência",
    "skills": "Skills",
    "course-about": "Desenvolvimento Web e Multimédia",
    "school": "Escola Superior de Tecnologia e Gestão",
    "course-about-12": "Restaurante/Bar",
    "month": "Julho",
    "exp-1": "Criador de Conteúdo para as Redes Sociais",
    "exp-2": "Gestor de Redes Sociais",
    "exp-3": "Motion Graphics Designer",
    "port": "Portefólio",
    "all": "Todos",
    "socialmedia": "Redes Sociais",
    "motiongraphics": "Motion Graphics",
    "social+motion": "Redes Sociais Motion Graphics",
    "solarenergy": "Energia Solar",
    "socialmediaport": "Redes Sociais",
    "hamburguer": "Hambur Gueria",
    "solarenergyinfo": "<p>A Solar Home, uma empresa fictícia que lidera o setor de energia solar, procurou destacar-se nas redes sociais. O desafio era claro: criar um poster atraente que chamasse a atenção de novos clientes e os incentivasse a adotar a energia solar como a sua fonte de energia sustentável.</p><br><p>A abordagem envolveu a criação de um poster vibrante, com cores que ecoassem a vitalidade da energia solar. Combinado com uma imagem cativante, o poster foi planejado meticulosamente, garantindo que cada elemento se destacasse e transmitisse uma mensagem impactante. O resultado foi um poster original que não só captou a atenção, mas também forneceu informações cruciais e uma maneira fácil de entrar em contacto.</p><br><p>Isso representa um exemplo claro de compromisso em transformar desafios em oportunidades criativas e impactantes.</p>",
    "hamburgueria": "Hamburgueria",
    "hamburgueriainfo": "<p>A Hamburgueria Machado, um local que é referência em sabor e qualidade, contou com a criação de um pôster tentador e profissional para destacar uma das suas deliciosas opções de hambúrgueres do menu, acompanhada da clássica coca-cola e da irresistível batata frita.</p><br><p>O objetivo era criar um pôster que transmitisse a essência do sabor inigualável dos hambúrgueres da Hamburgueria Machado. Para isso, planejou-se detalhadamente cada elemento, escolhendo cores vibrantes que evocam a paixão pela comida, combinando-as com imagens cativantes e um texto que despertasse a curiosidade do cliente.</p><br><p> O resultado foi um pôster clean mas vibrante que não só capta a atenção, mas também informa os clientes sobre as ofertas tentadoras.</p>",
    "bangkokinfo": "<p>O Bangkok Thai Restaurant é um renomado estabelecimento gastronômico localizado em Barcelos, conhecido pela sua culinária tailandesa autêntica, ambiente acolhedor e serviço excepcional.</p><br><p>O desafio ao trabalhar com o Bangkok Thai Restaurant era desenvolver uma estratégia de redes sociais abrangente e criar conteúdo visual cativante para promover eficazmente o restaurante nas redes sociais, mas também informar os clientes de possíveis alterações ao horário. O objetivo principal era aumentar a visibilidade online, engajar a comunidade local e transmitir a autenticidade da experiência Bangkok Thai Restaurant. Com essa finalidade colaborou-se com o cliente para desenvolver uma estratégia de redes sociais personalizada que envolveu a definição de metas e criação de um cronograma de publicações.</p><br><p>Produziu-se uma variedade de materiais visuais, incluindo imagens de pratos deliciosos e motion graphics que refletiam a autenticidade e a riqueza da culinária tailandesa tendo assim conseguido atingir os objetivos do cliente que teve um bom crescimento nas redes sociais.</p>",
    "dreamsakosinfo": "<p>A Dreamsakos é uma empresa especializada na criação de embalagens personalizadas, abrangendo uma ampla variedade de produtos, desde sacos de papel, tecido reutilizável, laminados recicláveis e até soluções como PVC, fitas e etiquetas.</p><br><p>A meta consistia em criar materiais gráficos como posters de divulgação para as redes sociais e o desenvolvimento de uma animação digital do logótipo da empresa. Antes de começar a produção foi proposto e definido com o cliente um cronograma de publicações para garantir uma distribuição consistente do conteúdo nas redes sociais. Estes posters consistiram em atrair novos clientes e para tal foram usadas fotos de produtos já finalizados para um maior engajamento.</p><br><p>A animação digital teve como principal foco o logótipo desenvolvendo uma animação simples e criativa que foi mais tarde divulgada nas redes sociais.</p>",
    "bestsolinfo": "<p>A BestSol é uma empresa com experiência no setor de energia solar, comprometida em fornecer soluções de energia sustentável por meio de uma equipe altamente qualificada.</p><br><p>Este projeto foi desenvolvido tendo em conta o seu propósito que era a divulgação de serviços e a aquisição de novos clientes. Com isto em mente foram desenvolvidos diversos posters para as redes sociais remetendo principalmente á energia renovável e sensibilizando os possíveis clientes a aderir a esta fonte de energia.</p><br><p>As principais cores usadas foram tons de laranja, azul e verde que remetem á natureza e á energia renovável, que teve um efeito positivo gerando um aumento de partilhas e seguidores nas redes sociais.</p>",
    "e+3plusinfo": "<p>A E+3 Plus é uma empresa têxtil com um foco sólido no mercado B2B (Business to Business), especializada na produção de vestuário sustentável, de luxo e de alta qualidade alcançado através da sua abordagem vertical.</p><br><p>Esta empresa contou com a criação de vários elementos visuais em inglês, dado ao seu elevado número de clientes estrangeiros. Além de divulgar a empresa e a sua plataforma B2B, os posters foram também utilizados para destacar as suas máquinas têxteis, dando a conhecer os seus métodos de trabalho e estabelecendo uma conexão mais profunda com potenciais clientes.</p><br><p>Este é um exemplo da diversidade que pode ser alcançada ao manter os valores e a marca da empresa em cada pôster desenvolvido.</p>",
    "ec3rinfo": "<p>A EC3R, empresa de gestão de resíduos e reciclagem, é especializada na recolha e gestão de Óleos Alimentares Usados (OAU) sendo a sua principal atividade a reciclagem desses resíduos direcionando-os para a produção de biocombustíveis avançados.</p><br><p>O presente projeto teve como missão a sensibilização das pessoas  para a importância da reciclagem de óleo alimentar usado. Com essa finalidade em mente foram definidos com a EC3R diversos pontos chave que cada poster deveria refletir tendo passado pela apresentação da empresa, dos seus serviços, dos seus parceiros e dos benefícios da reciclagem de OAU.</p><br><p>Estes posters foram desenvolvidos mantendo um aspeto minimalista e simples que atendeu às expectativas do cliente e da mensagem designada.</p>",
    "aznegociosinfo": "<p>A AZ Negócios é uma empresa especializada em internet e multimédia com experiência em web design e construção de websites.</p><br><p>Devido ao seu interesse em se destacar nas redes sociais, para atrair mais clientes, foram elaborados diversos conteúdos multimédia tendo sido produzida uma animação digital da sua logótipo, assim como a conceção de posters para divulgar a empresa e os serviços que ela oferece. Para alcançar este destaque nas redes sociais os posters foram desenvolvidos com diversos elementos 3D e cores vibrantes que captassem a atenção do potencial cliente, mas mantendo a presença da marca para serem facilmente reconhecidos.</p><br><p>O resultado foi positivo, com bom engajamento e aumento da visibilidade da empresa nas redes sociais.</p>",
    "ecgmdwminfo": "<p>Este projeto envolveu a criação de animações digitais dos logótipos dos cursos académicos DWM (Desenvolvimento Web e Multimédia) e ECGM (Engenharia da Computação Gráfica e Multimédia). O curso DWM é um CTeSP (Curso Técnico Superior Profissional), enquanto o ECGM é uma licenciatura. As animações foram desenvolvidas como parte da unidade curricular de Projeto Web e Multimédia.</p><br><p>Cada animação foi cuidadosamente planeada e executada para ter uma duração de 5 a 8 segundos, tornando-as ideais para o uso em apresentações dos cursos. O aspeto mais marcante deste projeto foi a singularidade das animações, tendo cada uma delas adotado um estilo visual distinto.</p><br><p>O objetivo principal era desenvolver animações que não apenas representassem os cursos, mas também captassem a atenção do público e refletissem a singularidade de ambos os cursos de maneira eficaz.</p>",
    "contactme": "Entre em Contacto",
    "yourname": "Nome",
    "yourmessage": "Mensagem",
    "submit": "Submeter",
    "throughmy": "Através do meu",
    "orthisform": "Ou deste formulário",
    "reset": "Redefinir",
    "privacyform": "Declaro que li e aceito a",
    "privacyformmessage": "Por favor, aceite a política de privacidade para poder submeter o formulário.",
    "privacyformmessageno": "(Se não aceitar, não poderá enviar este formulário.)",
    "no": "Não",
    "yes": "Sim",
    "privacypolicy": "Política de Privacidade",
    "cookiepolicy": "Política de Cookies",
    "pp1": "1. Introdução",
    "pp1info": "Bem-vindo ao Portefólio de Miguel Miranda. A sua privacidade é importante para nós. Esta Política de Privacidade explica como coletamos, usamos e protegemos as informações pessoais que você fornece quando visita o nosso Site.",
    "pp2": "2. Informações que Coletamos",
    "pp2info1": "Quando você visita o Site, coletamos as seguintes informações:",
    "pp2info2": "<strong>Nome e endereço de e-mail: </strong>Essas informações são coletadas através do formulário de contato do Site.",
    "pp2info3": "<strong>Dados de uso: </strong>Esses dados são coletados por meio de cookies, incluindo os cookies do Google Analytics. Para obter mais informações sobre cookies, consulte a seção 'Cookies' abaixo.",
    "pp3": "3. Como Usamos as Suas Informações",
    "pp3info1": "Usamos as suas informações pessoais apenas para os seguintes fins:",
    "pp3info2": "<strong>Para responder às suas consultas enviadas através do formulário de contato.</strong>",
    "pp3info3": "<strong>Para analisar o tráfego do Site e melhorar os nossos serviços.</strong>",
    "pp4": "4. Cookies",
    "pp4info1": "Usamos cookies para coletar informações sobre o uso do Site. Para obter informações detalhadas sobre cookies usados, como desativá-los e gerenciar as suas preferências, consulte a nossa",
    "pp4info2": "Política de Cookies.",
    "pp5": "5. Compartilhamento de Informações",
    "pp5info": "Não compartilhamos as suas informações pessoais com terceiros, a menos que seja necessário para cumprir com obrigações legais.",
    "pp6": "6. Proteção de Dados",
    "pp6info": "Tomamos medidas para proteger as suas informações pessoais e garantir a sua segurança.",
    "pp7": "7. Seus Direitos",
    "pp7info": "Você tem o direito de acessar, corrigir, excluir ou de se opor ao processamento das suas informações pessoais. Para exercer esses direitos ou fazer perguntas sobre esta Política de Privacidade, entre em contato conosco através dos detalhes fornecidos na seção de contacto.",
    "pp8": "8. Alterações a esta Política",
    "pp8info": "Podemos atualizar esta Política de Privacidade periodicamente. Quaisquer alterações serão publicadas nesta página.",
    "pp9": "9. Declaração de aplicabilidade",
    "pp9info": "Esta Política de Privacidade aplica-se a todos os utilizadores do site, incluindo os utilizadores da União Europeia.",
    "pp10": "10. Segurança dos dados pessoais",
    "pp10info1": "A segurança dos dados pessoais dos nossos utilizadores é importante para nós. Tomamos medidas de segurança para proteger esses dados, mas é importante lembrar que nenhuma transmissão pela Internet ou armazenamento eletrônico é 100% segura.",
    "pp10info2": "O site Portefólio Miguel Miranda toma as medidas de segurança necessárias para proteger os dados pessoais dos seus utilizadores. Estas medidas incluem o armazenamento dos dados pessoais em servidores seguros.",
    "pc1": "1. O que são cookies?",
    "pc1info": "Cookies são pequenos arquivos de texto que são armazenados no seu dispositivo quando você visita um site. Eles são amplamente usados para tornar os sites mais eficientes e melhorar a experiência do usuário. Os cookies também podem ser usados para rastrear informações sobre como os visitantes interagem com o site.",
    "pc2": "2. Como usamos cookies?",
    "pc2info1": "Usamos cookies para os seguintes fins:",
    "pc2info2": "<strong>Cookies essenciais: </strong>Esses cookies são essenciais para que você possa navegar pelo site e usar os seus recursos. Sem esses cookies, não podemos fornecer serviços que você solicitou, como a lembrança das configurações de cookies.",
    "pc2info3": "<strong>Cookies de desempenho: </strong>Esses cookies ajudam-nos a entender como os visitantes interagem com o nosso site, coletando informações anônimas. Isso permite-nos melhorar continuamente o nosso site e a sua experiência.",
    "pc2info4": "<strong>Cookies de funcionalidade: </strong>Esses cookies permitem que o site lembre das escolhas que você faz (como o idioma e Dark/Light Mode) e oferece recursos aprimorados.",
    "pc2info5": "<strong>Cookies de terceiros: </strong>Este site também pode incluir cookies de terceiros, como o Google Analytics, que é usado para coletar informações sobre como os visitantes usam o site. Esses cookies podem ser usados para fornecer anúncios direcionados com base em suas preferências de navegação.",
    "pc3": "3. Cookies Usados",
    "pc3info1": "A seguir, apresentamos uma lista dos cookies que podem ser usados neste site, juntamente com as suas finalidades:",
    "pc3info2": "<strong>Cookie '_ga'</strong>",
    "pc3info3": "<strong>Finalidade: </strong>Este cookie é utilizado pelo Google Analytics para recolher informações sobre como os utilizadores interagem com o website. Os dados recolhidos são utilizados para melhorar o desempenho do website.",
    "pc3info4": "<strong>Validade: </strong>Este cookie expirará em 400 Dias.",
    "pc3info5": "<strong>Categoria: </strong>Cookie de Terceiros (Cookie de Análise).",
    "pc3info6": "<strong>Proprietário: </strong>Google Analytics.",
    "pc3info7": "<strong>Cookie '_ga_N6DXWGWBTK'</strong>",
    "pc3info8": "<strong>Finalidade: </strong>Este cookie é utilizado pelo Google Analytics para identificar utilizadores individuais e para acompanhar a sua atividade no website. Os dados recolhidos são utilizados para melhorar o desempenho do website e para fornecer aos utilizadores uma experiência mais personalizada.",
    "pc3info9": "<strong>Validade: </strong>Este cookie expirará em 400 Dias.",
    "pc3info10": "<strong>Categoria: </strong>Cookie de Terceiros (Cookie de Análise).",
    "pc3info11": "<strong>Proprietário: </strong>Google Analytics.",
    "pc3info12": "<strong>Cookie 'accept'</strong>",
    "pc3info13": "<strong>Finalidade: </strong>Este cookie é utilizado pelo Website Portefólio Miguel Miranda para identificar e guardar a escolha 'Aceitar' no Pop-Up dos Cookies.",
    "pc3info14": "<strong>Validade: </strong>Este cookie expirará em 400 Dias.",
    "pc3info15": "<strong>Categoria: </strong>Cookie Essencial.",
    "pc3info16": "<strong>Proprietário: </strong>Website Portefólio Miguel Miranda.",
    "pc3info17": "<strong>Cookie 'decline'</strong>",
    "pc3info18": "<strong>Finalidade: </strong>Este cookie é utilizado pelo Website Portefólio Miguel Miranda para identificar e guardar a escolha 'Rejeitar' no Pop-Up dos Cookies.",
    "pc3info19": "<strong>Validade: </strong>Este cookie expirará em 400 Dias.",
    "pc3info20": "<strong>Categoria: </strong>Cookie Essencial.",
    "pc3info21": "<strong>Proprietário: </strong>Website Portefólio Miguel Miranda.",
    "pc3info22": "<strong>Cookie 'learnmore'</strong>",
    "pc3info23": "<strong>Finalidade: </strong>Este cookie é utilizado pelo Website Portefólio Miguel Miranda para identificar e guardar a escolha 'Saber Mais' no Pop-Up dos Cookies.",
    "pc3info24": "<strong>Validade: </strong>Este cookie expirará em 1 Dia ou após o utilizador escolher 'Aceitar' ou 'Recusar' no Pop-Up dos Cookies.",
    "pc3info25": "<strong>Categoria: </strong>Cookie Essencial.",
    "pc3info26": "<strong>Proprietário: </strong>Website Portefólio Miguel Miranda.",
    "pc4": "4. Como gerenciar cookies",
    "pc4info1": "Você pode gerenciar as suas preferências de cookies alterando as configurações do seu navegador. Você pode optar por aceitar ou recusar cookies. Lembre-se de que a recusa de cookies pode afetar a funcionalidade do site.",
    "pc4info2": "Para obter informações detalhadas sobre como gerenciar cookies e as configurações do seu navegador, consulte a documentação do navegador que você utiliza.",
    "pc5": "5. Alterações na política de cookies",
    "pc5info": "Podemos atualizar a nossa política de cookies conforme necessário para refletir as mudanças em nossas práticas de cookies. Qualquer alteração será refletida nesta página.",
    "pc6": "6. Declaração de aplicabilidade",
    "pc6info": "Esta Política de Cookies aplica-se a todos os utilizadores do site, incluindo os utilizadores da União Europeia.",
    "pc7": "7. Segurança dos dados pessoais",
    "pc7info1": "A segurança dos dados pessoais dos nossos utilizadores é importante para nós. Tomamos medidas de segurança para proteger esses dados, mas é importante lembrar que nenhuma transmissão pela Internet ou armazenamento eletrônico é 100% segura.",
    "pc7info2": "O site Portefólio Miguel Miranda toma as medidas de segurança necessárias para proteger os dados pessoais dos seus utilizadores. Estas medidas incluem o armazenamento dos dados pessoais em servidores seguros.",
    "next": "Próximo",
    "previous": "Anterior",
    "cookiesconsent": "Consentimento de Cookies",
    "cookiesmessage": "Este website utiliza cookies para melhorar a sua experiência de navegação. Ao clicar em 'Aceitar', concorda com a utilização de cookies. Para saber mais sobre os cookies que utilizamos, consulte a nossa política de cookies.",
    "accept": "Aceitar",
    "decline": "Recusar",
    "learnmore": "Saber Mais",
    "cookieserrormessage": "O Cookie não pode ser definido!"
}